{"tickers":[{"ticker":"SHLD","risklevel":"m","strategy_return":"178.94007756655722","risk_score":"59.747176675347113","company":"Sears Holdings Corporation","price":"31.78","change":"3.40","change_val":"1.04","rank":"15","stock_return":"-17.23","description":"Sears Holdings Corporation operates as a specialty retailer in the United States and Canada. The companys Kmart segment operates stores that sell merchandise under Jaclyn Smith and Joe Boxer labels; and Sears brand products, such as Kenmore, Craftsman, and DieHard. This segments stores provide consumer electronics, seasonal merchandise, outdoor living, toys, lawn and garden equipment, food and consumables, and apparel, as well as operate in-store pharmacies. Its Sears Domestic segment operates stores that sell merchandise under the Kenmore, Craftsman, DieHard, Lands End, Covington, Apostrophe, and Canyon River Blues brand names. This segments stores provide appliances, consumer electronics, tools, sporting goods, outdoor living, lawn and garden equipment, home fashion products, automotive products, apparel, footwear, jewelry, accessories, health and beauty products, pantry goods, household products, and toys. The Sears Domestic segment also provides clothing, accessories, footwear, and soft luggage; appliances and services to commercial customers in single-family residential construction/remodel, property management, multi-family new construction, and government/military sectors; premium appliance and plumbing fixtures to architects, designers, and new construction or remodeling customers; parts and repair services for appliances, lawn and garden equipment, consumer electronics, floor care products, and heating and cooling systems; and home improvement services. The companys Sears Canada segment engages in the retail of apparel and other softlines. Sears Holdings Corporation operates approximately 2,172 full-line stores and 1,338 specialty retail stores in the United States; 500 full-line and specialty retail stores in Canada, as well as operates 17 floor covering stores, 1,734 catalog pick-up locations, and 108 travel offices; and kmart.com and sears.ca Websites. The company was founded in 1899 and is based in Hoffman Estates, Illinois."},{"ticker":"DLTR","risklevel":"m","strategy_return":"154.5648265873549","risk_score":"64.484342489236695","company":"Dollar Tree Inc.","price":"83.11","change":"1.13","change_val":"0.93","rank":"26","stock_return":"-21.15","description":"Dollar Tree, Inc. operates discount variety stores in the United States and Canada. Its stores offer merchandise at the fixed price of $1.00. The companys stores provide consumable merchandise, including candy and food, and health and beauty care products; and household consumables, such as paper, plastics, household chemicals, and frozen and refrigerated food. Its stores also offer various merchandise comprising toys, durable housewares, gifts, party goods, greeting cards, softlines, and other items; and seasonal goods consisting of Easter, Halloween, and Christmas merchandise. The company operates its stores under the names of Dollar Tree, Deal$, Dollar Tree Deal$, Dollar Giant, and Dollar Bills. As of April 28, 2012, it operated 4,451 stores in 48 states and 5 Canadian Provinces. The company was founded in 1986 and is based in Chesapeake, Virginia."},{"ticker":"ISRG","risklevel":"m","strategy_return":"107.14049539336692","risk_score":"39.904297036872258","company":"Intuitive Surgical Inc.","price":"463.01","change":"0.65","change_val":"2.99","rank":"21","stock_return":"72.12","description":"Intuitive Surgical, Inc. designs, manufactures, and markets da Vinci surgical systems for various surgical procedures, including urologic, gynecologic, cardiothoracic, general, and head and neck surgeries. Its da Vinci surgical system consists of a surgeons console or consoles, a patient-side cart, a 3-D vision system, Firefly fluorescence imaging product, da Vinci skills simulator, and proprietary wristed instruments. The companys da Vinci surgical system translates the surgeons natural hand movements on instrument controls at the console into corresponding micro-movements of instruments positioned inside the patient through small puncture incisions, or ports. It also manufactures EndoWrist instruments consisting of forceps, scissors, electrocautery, scalpels, and other surgical tools, which incorporate wrist joints for natural dexterity for various surgical procedures. In addition, the company offers da Vinci single-site instruments and accessories that allow da Vinci Si surgical systems to work through a single incision than multiple incisions; and EndoWrist one vessel sealer, a wristed single-use instrument intended for bipolar coagulation and mechanical transection of vessels up to 7 mm in diameter and tissue bundles that fit in the jaws of the instrument. Further, it sells various vision and accessory products for use in conjunction with the da Vinci surgical system as surgical procedures are performed. The companys accessory products include sterile drapes used to ensure a sterile field during surgery; and vision products, such as replacement 3-D stereo endoscopes, camera heads, light guides, and other items. It markets its products through sales representatives in the United States, and through sales representatives and distributors in international markets. The company was founded in 1995 and is headquartered in Sunnyvale, California."},{"ticker":"VRTX","risklevel":"m","strategy_return":"93.03516625831125","risk_score":"58.390584991995674","company":"Vertex Pharmaceuticals Incorporated","price":"33.21","change":"-1.37","change_val":"-0.46","rank":"24","stock_return":"8.16","description":"Vertex Pharmaceuticals Incorporated engages in discovering, developing, manufacturing, and commercializing small molecule drugs for the treatment of serious diseases worldwide. Its products include telaprevir, a prescription medicine used for the treatment of patients with genotype 1 hepatitis C virus (HCV) infection; and Ivacaftor, a prescription medicine used for the treatment of cystic fibrosis. The company markets its products under the INCIVEK brand name in the United States and Canada; INCIVO brand in the United Kingdom, Germany, France, Sweden, Austria, Finland, Denmark, Switzerland, and Norway; KALYDECO brand in the United States; and TELAVIC brand in Japan. Its drug candidates comprise VX-222, a Phase II clinical trial drug candidate, and ALS-2200 and ALS-2158, a Phase I clinical trial drug candidates that are designed to inhibit the replication of HCV; VX-809 and VX-661, a Phase II clinical trial drug candidates that improve the function of defective cystic fibrosis; VX-509, a Phase II clinical trial drug candidate for the treatment of patients with rheumatoid arthritis and other immune-mediated inflammatory diseases; VX-765, a Phase II clinical trial drug for the treatment of epilepsy; and VX-787, an investigational drug candidate for the treatment of influenza A. The company was founded in 1989 and is headquartered in Cambridge, Massachusetts."},{"ticker":"AMZN","risklevel":"m","strategy_return":"87.460662527681009","risk_score":"35.542265900694005","company":"Amazon.com Inc.","price":"173.10","change":"0.44","change_val":"0.76","rank":"29","stock_return":"9.00","description":"Amazon.com, Inc. operates as an online retailer in North America and internationally. It operates retail Websites, such as amazon.com and amazon.ca. The company serves consumers through its retail Websites and focuses on selection, price, and convenience. It also offers programs that enable sellers to sell their products on companys Websites, and their own branded Websites. In addition, the company serves developers and enterprises through Amazon Web Services, which provides access to technology infrastructure that developers can use to enable virtually various type of business. Further, it manufactures and sells the Kindle e-reader. Additionally, the company provides fulfillment services; miscellaneous marketing and promotional agreements, such as online advertising; and co-branded credit cards. Amazon.com, Inc. was founded in 1994 and is headquartered in Seattle, Washington."},{"ticker":"BIIB","risklevel":"m","strategy_return":"81.052612448238293","risk_score":"40.667652485703449","company":"Biogen Idec Inc.","price":"110.05","change":"0.53","change_val":"0.58","rank":"28","stock_return":"63.76","description":"Biogen Idec Inc. discovers, develops, manufactures, and markets therapies for the treatment of neurodegenerative diseases, hemophilia, and autoimmune disorders in the United States and internationally. Its marketed products include the AVONEX for the treatment of relapsing multiple sclerosis (MS); RITUXAN for treating relapsed or refractory, CD20-positive, and B-cell Non-Hodgkin?s lymphoma (NHL); TYSABRI to treat relapsing MS; FUMADERM for the treatment of severe plaque psoriasis in adult patients; and FAMPYRA, an oral compound for the improvement of walking in adult patients with MS with walking disability. Biogen Idec Inc.?s products under Phase III consist of PEGylated interferon beta-1a designed to prolong the effects and reduce the dosing frequency of interferon beta-1a; BG-12 for the treatment of MS; Daclizumab, a monoclonal antibody in relapsing MS; Long-lasting factor IX and VIII fusion protein for the treatment of hemophilia B; GA101, a monoclonal antibody for the treatment of chronic lymphocytic leukemia and NHL; and Dexpramipexole, an orally administered small molecule for the treatment of amyotrophic lateral sclerosis. The company?s Phase I clinical trial products include Anti-LINGO for use in multiple sclerosis, Neublastin for use in neuropathic pain, CD40L for use in systemic lupus erythematosus, ANTI-TWAEK humanized monoclonal antibody for TWEAK, and BIIB037 for use in Alzheimers disease; and Phase II clinical trial product comprises OCRELIZUMAB, a humanized monoclonal antibody for treating CD20. It has collaboration agreements with Genentech, Inc.; Elan Pharma International, Ltd; Acorda Therapeutics, Inc.; Portola Pharmaceuticals, Inc.; Swedish Orphan Biovitrum AB; Abbott Biotherapeutics Corp; and Vernalis plc. The company was formerly known as IDEC Pharmaceuticals Corporation and changed its name to Biogen Idec Inc. in November 2003. Biogen Idec Inc. was founded in 1985 and is headquartered in Weston, Massachusetts."},{"ticker":"CERN","risklevel":"m","strategy_return":"74.328954600857372","risk_score":"61.601039908222866","company":"Cerner Corporation","price":"61.25","change":"0.87","change_val":"0.53","rank":"5","stock_return":"32.17","description":"Cerner Corporation designs, develops, markets, installs, hosts, and supports healthcare information technology, healthcare devices, and content solutions for healthcare organizations and consumers worldwide. It offers the Cerner Millennium architecture, which combines clinical, financial, and management information systems that provides access to an individuals electronic health record (EHR) at the point of care, and organizes and delivers information for physicians, nurses, laboratory technicians, pharmacists, front and back-office professionals, and consumers. The company also provides the Healthe Intent platform, a cloud-based platform that sits above existing EHR systems and is designed to contain data from any EHR along with claims data, medical evidence, and research to facilitate proactive care. In addition, it offers a range of services, including implementation and training, remote hosting, operational management services, revenue cycle services, support and maintenance, healthcare data analysis, clinical process optimization, transaction processing, employer health centers, employee wellness programs, and third party administrator services for employer-based health plans. The company serves integrated delivery networks, physician groups and networks, managed care organizations, hospitals, medical centers, reference laboratories, home health agencies, blood banks, imaging centers, pharmacies, pharmaceutical manufacturers, employers, governments, and public health organizations. Cerner Corporation was founded in 1979 and is headquartered in North Kansas City, Missouri."},{"ticker":"DELL","risklevel":"m","strategy_return":"71.122836150287753","risk_score":"63.83876188108232","company":"Dell Inc.","price":"14.63","change":"0.88","change_val":"0.13","rank":"4","stock_return":"6.87","description":"Dell Inc. provides integrated technology solutions in the information technology (IT) industry worldwide. It designs, develops, manufactures, markets, sells, and supports mobility and desktop products, including notebooks, workstations, tablets, smartphones, and desktop PCs, as well as servers and networking products. The company offers storage solutions, including storage area networks, network-attached storage, direct-attached storage, and various backup systems. It also provides IT and business services comprising transactional services, such as support, managed deployment, enterprise installation, and configuration services; outsourcing services, including data center and systems management, network management, life cycle application development and management, and business process outsourcing services; and project-based services consisting of IT infrastructure, applications, business process, and business consulting services. In addition, the company offers third-party software products comprising operating systems, business and office applications, anti-virus and related security software, and entertainment software; and peripheral products, such as printers, televisions, notebook accessories, mouse, keyboards, networking and wireless products, and digital cameras. Further, it provides financial services, including originating, collecting, and servicing customer receivables related to the purchase of its products and third-party technology products. The company sells its products and services directly through its sales representatives, telephone-based sales, and online sales; and through retailers, third-party solution providers, system integrators, and third-party resellers. It serves corporate businesses, law enforcement agencies, small and medium businesses, consumers, and public institutions that include government, education, and healthcare organizations. Dell Inc. was founded in 1984 and is headquartered in Round Rock, Texas."},{"ticker":"AAPL","risklevel":"m","strategy_return":"70.613325528238249","risk_score":"55.721021936654594","company":"Apple Inc.","price":"405.00","change":"0.03","change_val":"0.12","rank":"35","stock_return":"70.13","description":"Apple Inc., together with subsidiaries, designs, manufactures, and markets mobile communication and media devices, personal computers, and portable digital music players; and sells related software, services, peripherals, networking solutions, and third-party digital content and applications worldwide. Its products and services include iPhone, iPad, Mac, iPod, Apple TV, the iOS and Mac OS X operating systems, iCloud, and various accessory and support offerings, as well as a range of consumer and professional software applications. The company sells its products and services to consumers, small and mid-sized business, education, enterprise, and government customers through its retail stores, online stores, and direct sales force, as well as through third-party cellular network carriers, wholesalers, retailers, and value-added resellers. In addition, it offers various third-party iPhone, iPad, Mac, and iPod compatible products, including application software, printers, storage devices, speakers, headphones, and other accessories and peripherals, through its online and retail stores; and digital content and applications through the iTunes Store, App Store, iBookstore, and Mac App Store. As of September 24, 2011, the company had 357 retail stores, including 245 stores in the United States and 112 stores internationally. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California."},{"ticker":"EBAY","risklevel":"m","strategy_return":"67.973545760621462","risk_score":"44.013330367152165","company":"eBay Inc.","price":"30.33","change":"0.10","change_val":"0.03","rank":"2","stock_return":"28.31","description":"eBay Inc. provides online platforms, services, and tools to help individuals and merchants in online and mobile commerce and payments in the United States and internationally. Its Marketplaces segment operates ecommerce platform eBay.com; vertical shopping sites, such as StubHub, Fashion, Motors, and Half.com; and classifieds Websites, including Den Blå Avis, BilBasen, Gumtree, Kijiji, LoQUo, Marktplaats.nl, mobile.de, Alamaula, eBay Anuncios, eBay Kleinanzeigen, and eBay Annunci, as well as provides advertising services. The companys Payments segment offers payment and settlement services for consumers and merchants on and off eBay Websites and other merchant Websites. This segment operates PayPal, which enables individuals and businesses to send and receive payments online and through mobile devices; Bill Me Later that enables the United States merchants to offer, the United States consumers to obtain, credit at the point of sale for ecommerce and mobile transactions; Zong, which allows users with mobile phones to purchase digital goods and have the transactions charged to their phone bill; and BillSAFE that enables customers pay for purchases upon receipt of an invoice. Its GSI segment offers an ecommerce services suite for enterprise clients that operate in general merchandise categories, including apparel, sporting goods, toys and baby, health and beauty, and home; and marketing services comprising full-service digital agency, enterprise email marketing, mobile advertising, affiliate marketing, advertisement retargeting, and in-depth analytics services. The company also offers X.commerce platform that provides software developers access to the companys applications programming interfaces to develop functionality for various merchants; and Magento Connect, which allows developers to market and sell add-on functionality and solutions to merchants that use a Magento storefront. eBay Inc. was founded in 1995 and is headquartered in San Jose, California."},{"ticker":"WYNN","risklevel":"m","strategy_return":"66.003181106788574","risk_score":"57.928209691560781","company":"Wynn Resorts Ltd.","price":"110.49","change":"-0.14","change_val":"-0.15","rank":"33","stock_return":"2.40","description":"Wynn Resorts, Limited, together with its subsidiaries, engages in the development, ownership, and operation of destination casino resorts. The company owns and operates two casino resort complexes in Las Vegas, the Wynn Las Vegas and Encore at Wynn Las Vegas with approximately 4,750 hotel rooms and suites; 220 table games; 2,430 slot machines; and 1 poker room in approximately 186,000 square feet of casino gaming space, including a sky casino and private gaming salons; 35 food and beverage outlets; 2 spas and salons; lounges; and approximately 97,000 square feet of retail space featuring various boutiques. Its Las Vegas resorts also offer 3 nightclubs; 1 beach club; 1 Ferrari and Maserati automobile dealership; wedding chapels; golf course; approximately 283,000 square feet of meeting space; 1 theater; and 1 Encore Theater. In addition, the company operates Wynn Macau casino resort and Encore at Wynn Macau resort located in the Macau Special Administrative Region of the Peoples Republic of China. Its Macau resorts feature approximately 1,008 hotel rooms and suites; 486 table games; 930 slot machines; and 1 poker pit in approximately 265,000 square feet of casino gaming space, including 1 sky casino and private gaming salons; 8 restaurants; 2 spas and 1 salon; lounges; meeting facilities; and approximately 54,200 square feet of retail space featuring various boutiques, as well as a show in the rotunda. Wynn Resorts, Limited was founded in 2002 and is based in Las Vegas, Nevada."},{"ticker":"YHOO","risklevel":"m","strategy_return":"56.024668273786801","risk_score":"60.824598365983142","company":"Yahoo! Inc.","price":"16.13","change":"0.00","change_val":"0.00","rank":"14","stock_return":"-3.70","description":"Yahoo! Inc., together with its subsidiaries, operates as a digital media company that delivers personalized digital content and experiences through various devices worldwide. It offers online properties and services to users; and a range of marketing services to businesses. The companys communications and communities offerings include Yahoo! Mail, Yahoo! Messenger, Yahoo! Groups, Yahoo! Answers, Flickr, and Connected TV, which provide a range of communication and social services to users and small businesses enabling users to organize into groups and share knowledge, common interests, and photos. Its search products comprise Yahoo! Search and Yahoo! Local, available free to users to navigate the Internet and discover content. The companys marketplaces offerings and services include Yahoo! Shopping, Yahoo! Travel, Yahoo! Real Estate, Yahoo! Autos, and Yahoo! Small Business, which allow users to research specific topics, products, services, or areas of interest by reviewing and exchanging information, obtaining contact details, or considering offers from providers of goods, services, or parties with similar interests. Its media offerings comprise Yahoo! Homepage, Yahoo! News, Yahoo! Sports, Yahoo! Finance, My Yahoo!, Yahoo! Toolbar, Yahoo! Entertainment & Lifestyles, Yahoo! Contributor Network, and Yahoo! Pulse, which are designed to engage users with online content and services on the Web. The company also offers marketing services, such as display and search advertising, listing-based services, and commerce-based transactions to advertisers. In addition, it provides software and platform offerings for third-party developers, advertisers, and publishers, such as Yahoo! Developer Network, Yahoo! Open Strategy, Yahoo! Application Platform, Yahoo! Updates, Yahoo! Query Language, and Yahoo! Search BOSS. The company has strategic alliances with Nokia and ABC News, Inc. Yahoo! Inc. was founded in 1994 and is headquartered in Sunnyvale, California."},{"ticker":"MYL","risklevel":"m","strategy_return":"54.936155822480345","risk_score":"46.04167484547505","company":"Mylan Inc.","price":"21.46","change":"1.60","change_val":"0.34","rank":"37","stock_return":"-0.92","description":"Mylan Inc., together with its subsidiaries, engages in the development, manufacture, marketing, licensing, and distribution of generic and branded generic pharmaceuticals, specialty pharmaceuticals, and active pharmaceutical ingredients (APIs) worldwide. It operates in two segments, Generics and Specialty. The Generics segment primarily develops, manufactures, sells, and distributes generic or branded generic pharmaceutical products in tablet, capsule, and injectable or transdermal patch forms, as well as API. It also focuses on developing APIs with non-infringing processes to partner with generic manufacturers. This segment serves proprietary and ethical pharmaceutical wholesalers and distributors, group purchasing organizations, drug store chains, independent pharmacies, drug manufacturers, institutions, and public and governmental agencies. The Specialty segment manufactures and sells branded specialty injectable, nebulized, and transdermal products for life-threatening conditions. Its products include EpiPen Auto-Injector to treat severe allergic reactions; and Perforomist Inhalation Solution, a formoterol fumarate inhalation solution for the maintenance treatment of bronchoconstriction in chronic obstructive pulmonary disorder patients. This segment serves pharmaceutical wholesalers and distributors, pharmacies, and healthcare institutions primarily in the United States. Mylan Inc. also manufactures and sells injectable products in various therapeutic areas for the hospital setting; supplies APIs for the manufacture of antiretroviral (ARV) drugs to treat HIV/AIDS; offers finished dosage form products in the ARV market; and manufactures non-ARV FDF products, as well as focuses on developing, manufacturing, and commercializing dry powder inhaler delivery platform. The company was formerly known as Mylan Laboratories Inc. and changed its name to Mylan Inc. in October 2007. Mylan Inc. was founded in 1961 and is based in Canonsburg, Pennsylvania."},{"ticker":"NVDA","risklevel":"m","strategy_return":"54.886101978812405","risk_score":"53.76246995651055","company":"NVIDIA Corporation","price":"13.86","change":"0.79","change_val":"0.11","rank":"22","stock_return":"-14.43","description":"NVIDIA Corporation provides graphics chips for use in smartphones, personal computers (PC), tablets, and professional workstations markets worldwide. It operates in three segments: Graphic Processing Unit (GPU), Professional Solutions Business (PSB), and Consumer Products Business (CPB). The GPU segment offers GeForce discrete graphics and chipset products, which support desktop and notebook PCs, as well as sells flash memory products. The PSB segment provides Quadro professional workstation products and Tesla high-performance computing products to deliver high graphics performance and application compatibility for professionals in the manufacturing, entertainment, medical, science, and aerospace industries. The CPB segment offers Tegra system-on-chip products for smartphones, tablets, automotive infotainment systems, and other similar devices; and Icera baseband processors and radio frequency transceivers for mobile connectivity. This segment also licenses video game consoles and other digital consumer electronics devices. The company sells its products to original equipment manufacturers, original design manufacturers, add-in-card and motherboard manufacturers, system builders, and consumer electronics companies. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California."},{"ticker":"NFLX","risklevel":"m","strategy_return":"54.341631861384187","risk_score":"38.892305813278902","company":"Netflix Inc.","price":"69.29","change":"0.01","change_val":"0.01","rank":"8","stock_return":"-74.44","description":"Netflix, Inc. provides Internet subscription services for TV shows and movies in the United States and internationally. The company offers its subscribers to watch unlimited TV shows and movies streamed over the Internet to their TVs, computers, and mobile devices. It also provides standard definition DVDs and Blu-ray discs to its subscribers. The company was founded in 1997 and is headquartered in Los Gatos, California."},{"ticker":"MXIM","risklevel":"m","strategy_return":"53.806990179048462","risk_score":"64.615203423322043","company":"Maxim Integrated Products Inc.","price":"26.04","change":"0.72","change_val":"0.19","rank":"7","stock_return":"13.98","description":"Maxim Integrated Products, Inc. engages in designing, developing, manufacturing, and marketing various linear and mixed-signal integrated circuits worldwide. The company also provides various high-frequency process technologies and capabilities for use in custom designs. It primarily serves industrial, communications, consumer, and computing markets. The company markets its products through a direct-sales and applications organization, as well as through its own and other unaffiliated distribution channels. Maxim Integrated Products, Inc. was founded in 1983 and is headquartered in Sunnyvale, California."},{"ticker":"ADSK","risklevel":"m","strategy_return":"52.167188112366382","risk_score":"55.795176465969618","company":"Autodesk Inc.","price":"30.33","change":"0.23","change_val":"0.07","rank":"11","stock_return":"-9.59","description":"Autodesk, Inc. provides design software and services to customers worldwide. Its Platform Solutions and Emerging Business segment offers AutoCAD software, a customizable and extensible computer-aided design (CAD) application for professional design, drafting, detailing, and visualization in fields ranging from construction to manufacturing, civil engineering, and process plant design; and AutoCAD LT, a professional drafting and detailing software that includes document sharing capability. The companys Architecture, Engineering and Construction segment offers Autodesk Revit products, which provide model-based design and documentation system for architects, structural engineers, and design-build teams, as well as mechanical, electrical, and plumbing engineers; AutoCAD Civil 3D products, which provide a surveying, design, analysis, and documentation solution for civil engineering; AutoCAD Architecture software that includes architecture industry-specific tools to improve coordination; and AutoCAD Map 3D software, which provides direct access to data needed for infrastructure planning, design, and management activities. Autodesk, Inc.s Manufacturing segments products comprise Autodesk Inventor, which offers engineers a set of tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; AutoCAD Mechanical software that accelerates the mechanical design process; and Autodesk Moldflow, which provides tools that help manufacturers optimize the design of plastic parts and injection molds, and study the injection molding process. Its Media and Entertainment segment offers animation products that provide tools for digital sculpting, modeling, animation, effects, rendering, and compositing; and creative finishing products that provide editing, finishing, and visual effects design and color grading. The company also offers design and creation suites. Autodesk, Inc. was founded in 1982 and is headquartered in San Rafael, California."},{"ticker":"INTC","risklevel":"m","strategy_return":"52.085519631224301","risk_score":"42.55641196766863","company":"Intel Corporation","price":"24.25","change":"1.22","change_val":"0.29","rank":"32","stock_return":"21.47","description":"Intel Corporation designs, manufactures, and sells integrated digital technology platforms primarily in the Asia-Pacific, the Americas, Europe, and Japan. The company offers microprocessors that process system data and controls other devices in the system; and chipsets, which sends data between the microprocessor and input, display, and storage devices, such as keyboard, mouse, monitor, hard drive or solid-state drive, and CD, DVD, or Blu-ray drives; system-on-chip products that integrate its processing functions with other system components, including graphics, audio, and video onto a single chip; wired network connectivity products; and wireless connectivity products. It also provides mobile phone components comprising baseband processors, radio frequency transceivers, and power management integrated circuits; and mobile phone platforms, such as Bluetooth wireless technology and GPS receivers, software solutions, customization, and interoperability tests. In addition, the company offers endpoint security, network and content security, risk and compliance, and consumer and mobile security software products for consumer, mobile, and corporate environments to protect systems from malicious virus attacks, as well as loss of data. Further, it develops and licenses embedded and mobile device software products that comprise operating systems, virtualization technologies, middleware, and development tools; and provides NAND flash memory products, which are used in solid-state drives, portable memory storage devices, digital camera memory cards, and other devices. The company markets its products primarily to original equipment manufacturers, original design manufacturers, and industrial and communications equipment manufacturers in the computing and communications industries. Intel Corporation was founded in 1968 and is based in Santa Clara, California."},{"ticker":"MCHP","risklevel":"m","strategy_return":"51.366745159653647","risk_score":"58.722099358345226","company":"Microchip Technology Inc.","price":"36.63","change":"0.57","change_val":"0.21","rank":"1","stock_return":"8.36","description":"Microchip Technology Incorporated engages in the development, manufacture, and sale of semiconductor products for embedded control applications. The company offers microcontrollers, such as 8-bit, 16-bit, and 32-bit microcontrollers marketed under the PIC brand name, as well as 16-bit dsPIC digital signal controllers (DSC); and development tools that enable system designers to program a PIC microcontroller and dsPIC DSC for specific applications. It also provides analog and interface products, including power management, linear, mixed-signal, thermal management, RF Linear drivers, safety and security, and interface products; and memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, and serial SRAM memories for production of very small footprint devices. In addition, the company licenses its SuperFlash technology to foundries, integrated device manufacturers, and design partners for use in the manufacture of their advanced microcontroller products, gate array, RF, and analog products that require embedded flash; and provides engineering services. It serves automotive, communications, computing, consumer, and industrial control markets. The company sells its products through direct sales force and distributors worldwide. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona."},{"ticker":"GILD","risklevel":"m","strategy_return":"50.045690806036582","risk_score":"56.152863019136234","company":"Gilead Sciences Inc.","price":"40.93","change":"-0.91","change_val":"-0.38","rank":"3","stock_return":"22.24","description":"Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes human therapeutics for the treatment of life threatening diseases worldwide. Its products include Atripla, Truvada, Viread, Complera/Eviplera, and Emtriva for the treatment of human immunodeficiency virus (HIV) infection in adults; Viread and Hepsera oral formulations for the treatment of chronic hepatitis B; Letairis, an oral formulation for pulmonary arterial hypertension; Ranexa, a tablet for chronic angina; Lexiscan/Rapiscan, a test that detects and characterizes coronary artery disease; Cayston, an inhaled antibiotic for the treatment of respiratory systems in cystic fibrosis patients; Tamiflu, a capsule for the treatment and prevention of influenza A and B. The company also provides other products, such as AmBisome, an antifungal agent to treat serious invasive fungal infections; Vistide, an antiviral medication for the treatment of cytomegalovirus retinitis in patients with AIDS; and Macugen, an anti-angiogenic oligonucleotide to treat neovascular macular degeneration. In addition, it has product candidates in various stages for the treatment of HIV, which include integrase single-tablet regimen Quad; Cobicistat and Elvitegravir in Phase III; and GS-7340 in Phase II, as well as for liver disease, which consist of GS-7977 in Phase III; GS-5885, GS-9451, and GS-6624 in Phase II; and GS-7340, GS-9620, and GS-9669 in Phase I. Further, the companys product candidates in various stages for the treatment of cardiovascular/metabolic diseases comprise Ranolazine in Phase III; and for the treatment of respiratory diseases consist of Aztreonam for inhalation solution in Phase III, as well as GS-6624 in Phase I. Additionally, it has product candidates in various stages for inflammation/oncology diseases that include GS-1101 in Phase III; GS-1101 and GS-6624 in Phase II; and GS-9973 in Phase I. The company was founded in 1987 and is headquartered in Foster City, California."},{"ticker":"BBBY","risklevel":"m","strategy_return":"48.84212214880035","risk_score":"47.337198092919991","company":"Bed Bath &amp; Beyond Inc.","price":"57.97","change":"1.11","change_val":"0.64","rank":"36","stock_return":"16.87","description":"Bed Bath & Beyond Inc., together with its subsidiaries, operates a chain of retail stores. It sells a range of domestic merchandise, such as bed linens and related items, bath items, and kitchen textiles; and home furnishings, including kitchen and tabletop items, fine tabletop, basic housewares, general home furnishings, consumables, and certain juvenile products. The company also offers giftware, household products, and health and beauty care items; and infant and toddler merchandise. It operates stores under the names of Bed Bath & Beyond (BBB), Christmas Tree Shops (CTS), Harmon and Harmon Face Values (Harmon), and buybuy BABY. As of August 27, 2011, the company had a total of 1,155 stores, including 986 BBB stores, 70 CTS stores, 54 buybuy BABY stores, and 45 Harmon stores in 50 states, the District of Columbia, Puerto Rico, and Canada. It also operates two stores under the name of Home & More in the Mexico City through a joint venture. Bed Bath & Beyond Inc. was founded in 1971 and is based in Union, New Jersey."},{"ticker":"CHKP","risklevel":"m","strategy_return":"44.880000658270646","risk_score":"52.78537498200663","company":"Check Point Software Technologies Ltd.","price":"52.54","change":"0.76","change_val":"0.40","rank":"16","stock_return":"12.05","description":"Check Point Software Technologies Ltd. develops, markets, and supports a range of software, and combined hardware and software products and services for information technology (IT) security worldwide. It offers network and gateway security solutions that enable its customers to implement their security policies on network traffic between internal networks and the Internet, as well as between internal networks and private networks that are shared with partners; endpoint security solutions, which provide various software blades that run on individual computers connected to the network, such as desktop computers, laptop computers, and other mobile devices; and security management solutions to ensure consistent operations in accordance with an enterprises security policy. The company also offers technical services comprising technical customer support programs and plans, such as enterprise based support and collaborative enterprise support; certification and educational training on the checkpoints products; and professional services in implementing, upgrading, and optimizing checkpoints products, including design planning, security implementation, and project management services. In addition, it provides ZoneAlarm solutions that protect consumers from hackers, spyware, and identity theft. The company sells its products and services through a network of channel partners, including distributors, resellers, value-added resellers, system integrators, and managed services providers to enterprises, service providers, small and medium sized businesses, and consumers. Check Point Software Technologies Ltd. was founded in 1993 and is headquartered in Tel Aviv, Israel."},{"ticker":"CTSH","risklevel":"m","strategy_return":"38.522491086724806","risk_score":"38.949012218049219","company":"Cognizant Technology Solutions Corporation","price":"64.31","change":"-1.02","change_val":"-0.66","rank":"20","stock_return":"-14.66","description":"Cognizant Technology Solutions Corporation provides information technology (IT), consulting, and business process outsourcing services in North America, Europe, and internationally. Its IT consulting and technology services include business and knowledge process consulting; IT strategy consulting; program management consulting; technology consulting; application design, development, integration, and re-engineering, such as complex custom systems development, data warehousing/business intelligence, customer relationship management (CRM) system implementation, and enterprise resource planning (ERP) system implementation; and software testing services. The companys outsourcing services comprise application maintenance, including custom application, CRM, and ERP maintenance; IT infrastructure outsourcing; and business and knowledge process outsourcing. It serves various markets, such as financial services, healthcare and life sciences, manufacturing, logistics, retail, travel, hospitality, consumer goods, communications, and high technology, as well as information, media, and entertainment markets. The company markets and sells its services directly through its professional staff, senior management, and direct sales personnel. Cognizant Technology Solutions Corporation was founded in 1998 and is headquartered in Teaneck, New Jersey."},{"ticker":"CTRP","risklevel":"m","strategy_return":"37.969823471668683","risk_score":"42.403740877902393","company":"Ctrip.com International Ltd.","price":"23.40","change":"-0.30","change_val":"-0.07","rank":"18","stock_return":"-61.95","description":"Ctrip.com International, Ltd., together with its subsidiaries, provides travel services for hotel accommodations, airline tickets, and packaged tours in the Peoples Republic of China. It also offers independent leisure travelers bundled package-tour products, including group tours, semi-group tours, and private tours or packaged tours with various transportation arrangements, such as cruise, bus, or self-driving. In addition, the company provides integrated transportation and accommodation services; and various value-added services consisting of car rental, insurance, visa services, tour guides, transportation at destinations, and tickets. Further, it offers Internet-related advertising, aviation casualty insurance, and air-ticket delivery services. Additionally, the company sells Property Management System, a hotel information software; travel guidebooks, which provide information for independent travelers; and VIP membership cards that allow cardholders to receive discounts from various restaurants, clubs, and bars. Ctrip.com International, Ltd. was founded in 1999 and is headquartered in Shanghai, the Peoples Republic of China."},{"ticker":"XRAY","risklevel":"m","strategy_return":"36.800041527117401","risk_score":"40.46263702230307","company":"DENTSPLY International Inc.","price":"34.99","change":"0.88","change_val":"0.31","rank":"13","stock_return":"0.29","description":"DENTSPLY International Inc. designs, develops, manufactures, and markets dental consumable products, dental laboratory products, and dental specialty products worldwide. The companys dental consumable products include dental sundries, such as dental anesthetics, infection control products, prophylaxis pastes, dental sealants, impression materials, restorative materials, bone grafting materials, tooth whiteners, and topical fluoride; and small equipment, including high and low speed handpieces, intraoral curing light systems, dental diagnostic systems, and ultrasonic scalers and polishers used in dental offices for the treatment of patients. Its dental laboratory products comprise dental prosthetics, including artificial teeth, precious metal dental alloys, dental ceramics, and crown and bridge materials, as well as equipment products, such as computer aided machining ceramic systems and porcelain furnaces used in the preparation of dental appliances by dental laboratories. The companys dental specialty products consist of endodontic instruments and materials, implants and related products, bone grafting materials, 3D digital implantology, dental lasers, and orthodontic appliances and accessories. Its consumable medical device products include urological catheters, certain surgical products, medical drills, and other non-medical products. The companys customers include dentists, dental hygienists, dental assistants, dental laboratories, and dental schools. It distributes its dental products directly to dental laboratories and dental professionals, as well as through distributors, dealers, and importers. DENTSPLY International Inc. was founded in 1899 and is headquartered in York, Pennsylvania."},{"ticker":"CSCO","risklevel":"m","strategy_return":"35.031355946247821","risk_score":"62.983803778391376","company":"Cisco Systems Inc.","price":"18.08","change":"0.93","change_val":"0.17","rank":"6","stock_return":"8.92","description":"Cisco Systems, Inc. designs, manufactures, and sells Internet protocol (IP)-based networking and other products related to the communications and information technology industry worldwide. It offers routers that interconnects public and private IP networks for mobile, data, voice, and video applications; switching products, which provide connectivity to end users, workstations, IP phones, access points, and servers; application networking services; and home networking products, such as adapters, gateways, modems, and home network management software. The company also offers security products comprising span firewall, intrusion prevention, remote access, virtual private network, unified client, Web, and email security and network security products; storage area networking products for data center environments that deliver connectivity between servers and storage systems; collaboration products to integrate voice, video, data, and mobile applications on fixed and mobile networks; video connected home products, including digital video distribution systems and digital interactive set-top boxes; and wireless systems. In addition, it provides optical networking products, Cisco TelePresence systems, Cisco Unified Computing Systems, physical security and video surveillances, and digital media systems. Further, the company offers technical support services; and responsive, preventive, and consultative support services for its technologies. Cisco Systems, Inc. has strategic alliances with Accenture Ltd; AT&T Inc.; Cap Gemini S.A.; Citrix Systems, Inc.; EMC Corporation; Fujitsu Limited; Intel Corporation; International Business Machines Corporation; Italtel SpA; Johnson Controls Inc.; Microsoft Corporation; NetApp, Inc.; Nokia Corporation; Nokia Siemens Networks; Oracle Corporation; SAP AG; Sprint Nextel Corporation; Tata Consultancy Services Ltd.; VMware, Inc.; Wipro Limited; and Xerox Corporation. The company was founded in 1984 and is headquartered in San Jose, California."},{"ticker":"MSFT","risklevel":"m","strategy_return":"33.022814003045738","risk_score":"35.315440281612737","company":"Microsoft Corporation","price":"25.96","change":"0.23","change_val":"0.06","rank":"34","stock_return":"19.96","description":"Microsoft Corporation develops, licenses, and supports a range of software products and services for various computing devices worldwide. The companys Windows & Windows Live Division segment offers PC operating system that primarily includes Windows 7 and Windows Vista operating systems; Windows live suite of applications and Web services; and Microsoft PC hardware products. Its Microsofts Server and Tools segment provides Windows Server operating systems, Windows Azure, Microsoft SQL Server, SQL Azure, Windows Intune, Windows Embedded, Visual Studio, Silverlight, system center products, Microsoft consulting services, and product support services. This segment also offers enterprise consulting services; and training and certification to developers and information technology professionals, as well as builds standalone and software development lifecycle tools for software architects, developers, testers, and project managers. The companys Online Services Division segment provides online information and content through Bing, MSN portals, and adCenter, as well as Atlas online tools for advertisers. Its Microsoft Business Division segment offers Microsoft office; Microsoft Exchange; Microsoft SharePoint; Microsoft Lync; Microsoft Dynamics ERP and CRM; and Microsoft Office Web Apps, as well as office 365, an online service, offering Microsoft Office, Exchange, SharePoint, and Lync. The companys Entertainment and Devices Division segment provides Xbox 360 entertainment platform, which includes the Xbox 360 gaming and entertainment console, Kinect for Xbox 360, Xbox 360 video games, Xbox LIVE, and Xbox 360 accessories; Mediaroom, an Internet protocol television software; and Windows Phone that provide Microsoft Office and Xbox LIVE functionality. It markets and distributes its products and services through original equipment manufacturers, distributors, and resellers, as well as through online. The company was founded in 1975 and is based in Redmond, Washington."},{"ticker":"ADP","risklevel":"m","strategy_return":"32.853743799946521","risk_score":"44.248880048505789","company":"Automatic Data Processing Inc.","price":"54.01","change":"0.63","change_val":"0.34","rank":"9","stock_return":"18.18","description":"Automatic Data Processing, Inc. provides business outsourcing solutions. The company operates in three segments: Employer Services, Professional Employer Organization (PEO) Services, and Dealer Services. The Employer Services segment offers a range of human resource (HR) information, payroll processing, time and labor management, and tax and benefits administration solutions and services, including traditional and Web-based outsourcing solutions to employers in the United States, Canada, Europe, South America, Australia, and Asia. Its solutions assist employers in the staffing, management, payment, and retention of their employees. The PEO Services segment provides employment administration outsourcing solutions comprising payroll, payroll tax filing, HR guidance, 401(k) plan administration, benefits administration, compliance services, health and workers compensation coverage, and other supplemental benefits for employees. The Dealer Services segment offers integrated dealer management systems, digital marketing solutions, and other business management solutions to auto, truck, motorcycle, marine, recreational vehicle, and heavy machinery retailers in North America, Africa, the Middle East, and the Asia Pacific. It also provides integrated applications for various department and functional areas of the dealership, such as customer relationship management applications, front-end sales and marketing solutions, and IP telephony phone systems; and computer hardware, hardware maintenance services, software support, system design, and network consulting services to its dealership clients, as well as designs, establishes, and maintains communications networks. In addition, This segment offers digital marketing solutions and services, including Websites, sales leads, email, search, display, and social media marketing and management services to the automotive industry. The company was founded in 1949 and is headquartered in Roseland, New Jersey."},{"ticker":"XLNX","risklevel":"m","strategy_return":"32.138253636482418","risk_score":"34.473568272330333","company":"Xilinx Inc.","price":"32.06","change":"0.56","change_val":"0.18","rank":"25","stock_return":"-7.83","description":"Xilinx, Inc. designs, develops, and markets programmable platforms worldwide. Its programmable platforms include integrated circuits in the form of programmable logic devices (PLDs); software design tools; targeted reference designs; printed circuit boards; and predefined system functions delivered as intellectual property cores. The companys PLDs comprise field programmable gate arrays, complex programmable logic devices, and extensible processing platforms, which perform logic functions. It also provides design services, customer training, field engineering, and technical support. The company offers its products to electronic equipment manufacturers in end markets, such as wired and wireless communications, industrial, scientific and medical, aerospace and defense, audio, video and broadcast, consumer, automotive, and data processing. Xilinx, Inc. sells its products through independent distributors, as well as through a network of independent sales representative firms and a direct sales management organization. The company was founded in 1984 and is headquartered in San Jose, California."},{"ticker":"DTV","risklevel":"m","strategy_return":"31.168572553617469","risk_score":"54.74392696215066","company":"DIRECTV Inc.","price":"42.76","change":"0.19","change_val":"0.08","rank":"27","stock_return":"4.34","description":"DIRECTV provides digital television entertainment primarily in the United States and Latin America. The company engages in acquiring, promoting, selling, and distributing digital entertainment programming primarily via satellite to residential and commercial subscribers. It offers direct-to-home (DTH) digital television services, as well as multi-channel video programming distribution services under the DIRECTV and SKY brands. The company provides various channels of digital-quality video entertainment and CD-quality audio programming directly to subscribers homes or businesses, including approximately 170 national high-definition television channels and 4 3D channels; and video-on-demand service, which provides movie and television programs to broadband-connected subscribers. It also provides premium professional and collegiate sports programming, such as the NFL SUNDAY TICKET package that allows subscribers to view the NFL games. In addition, the company owns and operates three regional sports television networks based in Seattle, Washington; Denver, Colorado; and Pittsburgh, Pennsylvania under the ROOT SPORTS brand name. As of March 31, 2012, it served approximately 20.0 million subscribers in the United States; approximately 4.3 million subscribers primarily in Argentina, Chile, Colombia, Ecuador, Venezuela, and the Caribbean; approximately 4.2 million subscribers in Brazil; and 4.3 million subscribers in Mexico. The company was founded in 1990 and is based in El Segundo, California."},{"ticker":"CHRW","risklevel":"m","strategy_return":"31.093079688731294","risk_score":"34.826892794360766","company":"CH Robinson Worldwide Inc.","price":"69.78","change":"0.43","change_val":"0.30","rank":"31","stock_return":"-26.74","description":"C.H. Robinson Worldwide, Inc., a third-party logistics company, provides freight transportation services and logistics solutions to companies in various industries worldwide. It offers transportation and logistics services, such as truckload, less-than-truckload, intermodal, ocean, and air freight transportation, as well as transportation management, customs brokerage, and warehousing services through contractual relationships with approximately 53,000 transportation companies, including motor carriers, railroads, air freight carriers, and ocean carriers. The company also engages in buying, selling, and marketing fresh produce. It offers its fresh produce to grocery retailers, restaurants, produce wholesalers, and foodservice distributors through a network of independent produce growers and suppliers under the Fresh 1, Tomorrows Organics, Rosemont Farms, Melon Up, Tropicana, Welchs, Motts, and Glory Foods names. In addition, the company provides payment management and business intelligence services, such as funds transfer, fuel purchasing, and online expense management primarily to motor carrier companies and fuel distributors. It operates through a network of 235 branch offices in North America, Europe, Asia, South America, Australia, and the Middle East. C.H. Robinson Worldwide, Inc. was founded in 1905 and is headquartered in Eden Prairie, Minnesota."},{"ticker":"SYMC","risklevel":"m","strategy_return":"30.780964846235538","risk_score":"45.928262035934416","company":"Symantec Corporation","price":"15.65","change":"0.32","change_val":"0.05","rank":"12","stock_return":"-8.80","description":"Symantec Corporation provides security, storage, and systems management solutions to various organization and consumers worldwide. It operates in four segments: Consumer, Security and Compliance, Storage and Server Management, and Services. The Consumer segment provides Internet security for PCs, tablets, and mobile devices; services, such as online backup, online family protection, and remote help to individual users and home offices; and various free tools and services to consumers. The Security and Compliance segment offers solutions for endpoint security and management, compliance, messaging management, data loss prevention, encryption, managed security services, and authentication services; and solutions through its software-as-a-service (SaaS) and appliance security offerings. Its products enable customers to secure, provision, and remotely manage their laptops, PCs, mobile devices, and servers. The Storage and Server Management segment provides storage and server management, backup, archiving, eDiscovery, and data protection solutions in heterogeneous storage and server platforms; and solutions through its SaaS and appliance offerings. The Services segment offers consulting, business critical services, and education services to help customers address information security, availability, storage, and compliance needs. The company markets and sells its products through its direct sales force and eCommerce platform, as well as through distributors, direct marketers, Internet-based resellers, system builders, Internet service providers, wireless carriers, original equipment manufacturers, specialized partners, value-added resellers, large account resellers, managed service providers, system integrators, and in retail locations Symantec Corporation was founded in 1982 and is headquartered in Mountain View, California."},{"ticker":"MRVL","risklevel":"m","strategy_return":"27.52825633165099","risk_score":"66.176810570073854","company":"Marvell Technology Group Ltd.","price":"13.85","change":"-0.73","change_val":"-0.10","rank":"19","stock_return":"-25.35","description":"Marvell Technology Group Ltd. designs, develops, and markets analog, mixed-signal, digital signal processing, and embedded and standalone ARM-based microprocessor integrated circuits. It offers mobile and wireless products comprising communications processors; modem processors; Wi-Fi and other communication protocols, including Bluetooth and/or FM; mobile computing products; and connected home computing products. The company also provides a range of integrated data storage products, including hard disk drive, solid-state drive, hybrid hard disk drive, and optical disk drive controllers, as well as storage-system products. In addition, it offers networking products comprising cloud infrastructure products for home, private, and public cloud networks; and service provider infrastructure, including residential fiber access infrastructure and mobile Internet infrastructure, as well as the transition to intellectual property radio access networks. Further, the company provides printing ASIC products; digital video processing products; power management and green technology products, such as DSP switcher integrated regulators, analog switching regulators, and integrated power management IC products; and Smart-LED Lighting platform, as well as Smart Energy Platform driven by a Wi-Fi enabled microcontroller and integrated software. It operates in the United States, Canada, China, Germany, Hong Kong, India, Israel, Italy, Japan, Korea, Malaysia, the Netherlands, Singapore, Spain, Sweden, Switzerland, Taiwan, and the United Kingdom. Marvell Technology Group Ltd. was founded in 1995 and is headquartered in Hamilton, Bermuda."},{"ticker":"LIFE","risklevel":"m","strategy_return":"21.082748308556788","risk_score":"34.421223898696191","company":"Life Technologies Corporation","price":"38.91","change":"0.87","change_val":"0.34","rank":"17","stock_return":"-14.03","description":"Life Technologies Corporation operates as a global life sciences company. The companys Molecular Biology Systems division offers molecular biology-based technologies, including basic and real-time PCR, RNA interference, DNA synthesis, sample preparation, transfection, cloning and protein expression profiling, protein analysis, and thermo-cycler instrumentation technologies. Its Cell Systems division provides cell culture media and sera, stem cells and related tools, cellular imaging products, antibodies, drug discovery services, and cell therapy related products used in the study of cell function. The companys Genetic Systems division offers capillary electrophoresis systems and reagents, and next generation sequencing systems and reagents comprising SOLiD and Ion Torrent systems, as well as reagent kits developed specifically for applied markets, such as forensics and food safety, pharmaceutical quality monitoring, and animal health markets. Life Technologies Corporation also provides repair and maintenance services; and custom services, such as cell line development, custom media modification, and primers and custom assays development services. Its products offer research tools for genomics studies, proteomics studies, gene splicing, cellular analysis, and other research applications required by laboratories associated with universities, medical research centers, and government and other research institutions, as well as biotechnology, pharmaceutical, and chemical companies; and serves clinical labs, medical institutions, medical researchers, and various industries through sales and service professionals, e-commerce capabilities, and onsite supply center solutions. The company was founded in 1987 and is headquartered in Carlsbad, California."},{"ticker":"BMC","risklevel":"m","strategy_return":"19.930673704603041","risk_score":"37.304526479710013","company":"BMC Software Inc.","price":"32.78","change":"-0.52","change_val":"-0.17","rank":"10","stock_return":"-23.50","description":"BMC Software, Inc. develops software that provides system and service management solutions for enterprises in the United States and internationally. Its Enterprise Service Management segment offers solution suites for availability and performance management, event management, service impact management, and capacity optimization; for provisioning, configuration change, and compliance automation for servers, networks, applications, and databases; for service desk, incident management, service request management, problem management, asset management, service level management, change and release management, and identity management; and for service management and IT asset management. This segment also provides a solution suite that unifies information and processes from disparate management tools; and consulting, implementation, integration, IT process, organizational design, re-engineering, and educational services related to its software products. The companys Mainframe Service Management segment offers mainframe data and performance management solutions for availability and reliability of the business data, applications, and systems that support business processes; and enterprise workload automation solutions, including Control-M product line for data centers to automate their workloads and business processes, and Control-M output management solution to automate the task of managing the life cycle of mainframe output reports with report decollation, distribution, bundling, viewing, archival, and deletion. BMC Software, Inc. sells its products directly through its sales force; and through distributors, resellers, original equipment manufacturers, alliance partners, and systems integrators. Its customers include banks and financial service providers, government agencies, other service providers, manufacturers, telecommunication companies, educational institutions, retailers, and hospitals. The company was founded in 1980 and is headquartered in Houston, Texas."},{"ticker":"NTAP","risklevel":"m","strategy_return":"15.131755837324645","risk_score":"49.862814120767204","company":"NetApp Inc.","price":"36.27","change":"0.11","change_val":"0.04","rank":"23","stock_return":"-41.42","description":"NetApp, Inc. engages in the design, manufacturing, marketing, and technical support of networked storage solutions. It supplies enterprise storage and data management software, and hardware products and services. The company offers Data ONTAP, an operating system that supports storage area network (SAN) and network-attached storage (NAS) environments; storage efficiency technologies, including FlexVol, FlexClone, and Deduplication technologies; storage management and application integration software, such as OnCommand management software; fabric-attached storage unified storage systems, which support a range of data for users on various platforms; and virtual storage tier; V-Series network-based virtualization solutions that provide SAN and NAS access to the data stored in heterogeneous storage arrays. It also provides data protection software products, including Snapshot, SnapRestore, SnapVault, and Open Systems SnapVault techologies; MetroCluster products; and SnapMirror data replication solution. In addition, the company offers data retention and archive products, and Flash Cache modules; and storage security products for data security and key management in IP SAN, NAS, and tape backup environments; StorageGRID that enables intelligent data management and secure content retention; and professional services, global support solutions, and customer education and training. It serves energy, financial services, government, high technology, Internet, life sciences and healthcare services, manufacturing, media, entertainment, animation and video postproduction, and telecommunications industries. It offers its products in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company was formerly known as Network Appliance, Inc. and changed its name to NetApp, Inc. in March 2008. NetApp, Inc. was founded in 1992 and is headquartered in Sunnyvale, California."},{"ticker":"FSLR","risklevel":"m","strategy_return":"6.295695286266878","risk_score":"62.338223170236994","company":"First Solar Inc.","price":"33.76","change":"-2.74","change_val":"-0.95","rank":"30","stock_return":"-88.68","description":"First Solar, Inc. engages in the design, manufacture, and sale of solar modules using a thin-film semiconductor technology in the United States and internationally. The company is also involved in the design, construction, and sale of photovoltaic solar power systems. Its solar modules employ a thin layer of semiconductor material to convert sunlight into electricity. The companys integrated solar power systems activities include project development; engineering, procurement, and construction services; operating and maintenance services; and project finance. First Solar, Inc. sells its solar modules to solar power system project developers, system integrators, and operators; investor owned utilities; independent power developers and producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona."}]}